// SPDX-License-Identifier: MPL-2.0

package core

import (
	"regexp"
	"strings"
)

var (
	metadataSeasonSuffixes = []*regexp.Regexp{
		regexp.MustCompile(`(?i)[\s\p{P}]+(season|s)\s*0*([0-9]+)[\s\p{P}]*$`),
		regexp.MustCompile(`(?i)[\s\p{P}]+0*([0-9]+)(?:st|nd|rd|th)\s*season[\s\p{P}]*$`),
		regexp.MustCompile(`[\s\p{P}]+第\s*0*([0-9]+)\s*[季期][\s\p{P}]*$`),
		regexp.MustCompile(`[\s\p{P}]+第([一二三四五六七八九十]+)[季期][\s\p{P}]*$`),
	}
	metadataEpisodeSuffixes = []*regexp.Regexp{
		regexp.MustCompile(`(?i)[\s\p{P}]+(episode|ep|#)\s*0*[0-9]+[\s\p{P}]*$`),
		regexp.MustCompile(`[\s\p{P}]+第\s*0*[0-9]+\s*[話集][\s\p{P}]*$`),
		regexp.MustCompile(`[\s\p{P}]+0*[0-9]+\s*[話集][\s\p{P}]*$`),
		regexp.MustCompile(`[\s]*[-–—_:：]\s*0*[0-9]{1,4}[\s\p{P}]*$`),
	}
	metadataTraditionalSimplified = strings.NewReplacer(
		"萬", "万", "與", "与", "專", "专", "業", "业", "東", "东", "絲", "丝", "兩", "两", "個", "个", "為", "为", "麗", "丽", "義", "义", "之", "之", "亂", "乱", "亞", "亚", "產", "产", "佈", "布", "來", "来", "侶", "侣", "兒", "儿", "冊", "册", "寫", "写", "軍", "军", "農", "农", "凍", "冻", "減", "减", "別", "别", "剛", "刚", "創", "创", "劃", "划", "劇", "剧", "劍", "剑", "勁", "劲", "動", "动", "務", "务", "勝", "胜", "勞", "劳", "勢", "势", "區", "区", "協", "协", "單", "单", "卻", "却", "厲", "厉", "參", "参", "發", "发", "叢", "丛", "號", "号", "後", "后", "啟", "启", "嗎", "吗", "喪", "丧", "嘗", "尝", "團", "团", "國", "国", "圖", "图", "圓", "圆", "場", "场", "報", "报", "壓", "压", "壞", "坏", "壯", "壮", "夢", "梦", "夠", "够", "奪", "夺", "奮", "奋", "婦", "妇", "學", "学", "實", "实", "寶", "宝", "宮", "宫", "對", "对", "導", "导", "將", "将", "屬", "属", "島", "岛", "嶼", "屿", "巖", "岩", "廣", "广", "廳", "厅", "強", "强", "彈", "弹", "當", "当", "徑", "径", "從", "从", "復", "复", "恆", "恒", "愛", "爱", "憂", "忧", "懷", "怀", "應", "应", "戲", "戏", "戶", "户", "拋", "抛", "擇", "择", "擊", "击", "擠", "挤", "擔", "担", "據", "据", "擴", "扩", "攜", "携", "敗", "败", "數", "数", "敵", "敌", "斷", "断", "時", "时", "暫", "暂", "會", "会", "極", "极", "標", "标", "機", "机", "權", "权", "歡", "欢", "歸", "归", "氣", "气", "漢", "汉", "滅", "灭", "滿", "满", "灣", "湾", "潔", "洁", "濟", "济", "瀨", "濑", "無", "无", "煉", "炼", "熱", "热", "燈", "灯", "爭", "争", "獨", "独", "獲", "获", "現", "现", "環", "环", "畫", "画", "異", "异", "瘋", "疯", "盤", "盘", "盜", "盗", "眾", "众", "碼", "码", "礙", "碍", "禮", "礼", "種", "种", "穩", "稳", "窩", "窝", "簡", "简", "簽", "签", "級", "级", "紛", "纷", "紹", "绍", "經", "经", "結", "结", "絕", "绝", "綠", "绿", "緊", "紧", "線", "线", "總", "总", "繼", "继", "續", "续", "羅", "罗", "羨", "羡", "習", "习", "聖", "圣", "聞", "闻", "聯", "联", "聲", "声", "聽", "听", "職", "职", "臉", "脸", "臺", "台", "舊", "旧", "莊", "庄", "華", "华", "葉", "叶", "著", "著", "蓮", "莲", "藥", "药", "蘭", "兰", "術", "术", "衛", "卫", "裝", "装", "複", "复", "覺", "觉", "覽", "览", "見", "见", "規", "规", "視", "视", "親", "亲", "觀", "观", "觸", "触", "訴", "诉", "該", "该", "詳", "详", "說", "说", "諸", "诸", "謎", "谜", "講", "讲", "謝", "谢", "譯", "译", "證", "证", "識", "识", "譜", "谱", "護", "护", "變", "变", "讓", "让", "貓", "猫", "貝", "贝", "資", "资", "賽", "赛", "贊", "赞", "趨", "趋", "跡", "迹", "車", "车", "軌", "轨", "較", "较", "載", "载", "輕", "轻", "輪", "轮", "辦", "办", "運", "运", "過", "过", "還", "还", "進", "进", "遠", "远", "違", "违", "選", "选", "邊", "边", "郵", "邮", "鄉", "乡", "釋", "释", "鋼", "钢", "錄", "录", "錢", "钱", "錯", "错", "鍊", "链", "鎖", "锁", "鏡", "镜", "鐘", "钟", "長", "长", "門", "门", "閉", "闭", "開", "开", "間", "间", "閃", "闪", "閱", "阅", "隊", "队", "階", "阶", "隨", "随", "難", "难", "雜", "杂", "雙", "双", "電", "电", "霧", "雾", "靈", "灵", "頂", "顶", "預", "预", "頑", "顽", "頭", "头", "題", "题", "顏", "颜", "風", "风", "飛", "飞", "餘", "余", "館", "馆", "駛", "驶", "騎", "骑", "驚", "惊", "體", "体", "髮", "发", "鬥", "斗", "魚", "鱼", "鳥", "鸟", "鳴", "鸣", "麵", "面", "黃", "黄", "點", "点", "龍", "龙", "龜", "龟", "師", "师", "語", "语",
	)
)
